apache/nuttx/arch/arm/src/stm32h7/hardware/stm32h7x3xx_uart.h
/* Guard time and prescaler register */

#define USART_GTPR_PSC_SHIFT      (0)       /* Bits 0-7: Prescaler value */
#define USART_GTPR_PSC_MASK       (0xff << USART_GTPR_PSC_SHIFT)
#  define USART_GTPR_PSC(n)       ((uint32_t)(n) << USART_GTPR_PSC_SHIFT)
#define USART_GTPR_GT_SHIFT       (8)       /* Bits 8-15: Guard time value */
#define USART_GTPR_GT_MASK        (0xff <<  USART_GTPR_GT_SHIFT)
#  define USART_GTPR_GT(n)        ((uint32_t)(n) <<  USART_GTPR_GT_SHIFT)

/* Receiver timeout register */

#define USART_RTOR_RTO_SHIFT      (0)       /* Bits 0-23: Receiver timeout value */
#define USART_RTOR_RTO_MASK       (0xffffff << USART_RTOR_RTO_SHIFT)
#  define USART_RTOR_RTO(n)       ((uint32_t)(n) << USART_RTOR_RTO_SHIFT)
#define USART_RTOR_BLEN_SHIFT     (24)      /* Bits 24-31: Block Length */
#define USART_RTOR_BLEN_MASK      (0xff << USART_RTOR_BLEN_SHIFT)
#  define USART_RTOR_BLEN(n)      ((uint32_t)(n) << USART_RTOR_BLEN_SHIFT)

/* Request register */

#define USART_RQR_ABRRQ           (1 << 0)  /* Bit 0: Auto baud rate request */
#define USART_RQR_SBKRQ           (1 << 1)  /* Bit 1: Send break request */
#define USART_RQR_MMRQ            (1 << 2)  /* Bit 2: Mute mode request */
#define USART_RQR_RXFRQ           (1 << 3)  /* Bit 3: Receive data flush request */
#define USART_RQR_TXFRQ           (1 << 4)  /* Bit 4: Transmit data flush request */

/* Interrupt & status register */

#define USART_ISR_PE              (1 << 0)  /* Bit 0:  Parity error */
#define USART_ISR_FE              (1 << 1)  /* Bit 1:  Framing error */
#define USART_ISR_NE              (1 << 2)  /* Bit 2:  Noise detected flag */
#define USART_ISR_ORE             (1 << 3)  /* Bit 3:  Overrun error */
#define USART_ISR_IDLE            (1 << 4)  /* Bit 4:  Idle line detected */
#define USART_ISR_RXNE            (1 << 5)  /* Bit 5:  Read data register not empty */
#define USART_ISR_TC              (1 << 6)  /* Bit 6:  Transmission complete */
#define USART_ISR_TXE             (1 << 7)  /* Bit 7:  Transmit data register empty */
#define USART_ISR_LBDF            (1 << 8)  /* Bit 8:  LIN break detection flag */
#define USART_ISR_CTSIF           (1 << 9)  /* Bit 9:  CTS interrupt flag */
#define USART_ISR_CTS             (1 << 10) /* Bit 10: CTS flag */
#define USART_ISR_RTOF            (1 << 11) /* Bit 11: Receiver timeout */
#define USART_ISR_EOBF            (1 << 12) /* Bit 12: End of block flag */
#define USART_ISR_UDR             (1 << 13) /* Bit 13: SPI slave underrun error flag */
#define USART_ISR_ABRE            (1 << 14) /* Bit 14: Auto baud rate error */
#define USART_ISR_ABRF            (1 << 15) /* Bit 15: Auto baud rate flag */
#define USART_ISR_BUSY            (1 << 16) /* Bit 16: Busy flag */
#define USART_ISR_CMF             (1 << 17) /* Bit 17: Character match flag */
#define USART_ISR_SBKF            (1 << 18) /* Bit 18: Send break flag */
#define USART_ISR_RWU             (1 << 19) /* Bit 19: Receiver wakeup from Mute mode */
#define USART_ISR_WUF             (1 << 20) /* Bit 20: Wakeup from low-power mode flag */
#define USART_ISR_TEACK           (1 << 21) /* Bit 21: Transmit enable acknowledge flag */
#define USART_ISR_REACK           (1 << 22) /* Bit 22: Receive enable acknowledge flag */
#define USART_ISR_TXFE            (1 << 23) /* Bit 23: TXFIFO Empty */
#define USART_ISR_RXFF            (1 << 24) /* Bit 24: RXFIFO Full */
#define USART_ISR_TCBGT           (1 << 25) /* Bit 25: Transmission complete before guard time flag */
#define USART_ISR_RXFT            (1 << 26) /* Bit 26: RXFIFO threshold flag */
#define USART_ISR_TXFT            (1 << 27) /* Bit 27: TXFIFO threshold flag */

#define USART_ISR_ALLBITS         (0x0fffffff)

/* Interrupt flag clear register */

#define USART_ICR_PECF            (1 << 0)  /* Bit 0:  Parity error clear flag */
#define USART_ICR_FECF            (1 << 1)  /* Bit 1:  Framing error clear flag */
#define USART_ICR_NCF             (1 << 2)  /* Bit 2:  Noise detected flag *clear flag */
#define USART_ICR_ORECF           (1 << 3)  /* Bit 3:  Overrun error clear flag */
#define USART_ICR_IDLECF          (1 << 4)  /* Bit 4:  Idle line detected clear flag */
#define USART_ICR_TXFECF          (1 << 5)  /* Bit 5:  TXFIFO empty clear flag */
#define USART_ICR_TCCF            (1 << 6)  /* Bit 6:  Transmission complete */
#define USART_ICR_TCBGTCF         (1 << 7)  /* Bit 7:  Transmission complete before Guard time clear flag */
#define USART_ICR_LBDCF           (1 << 8)  /* Bit 8:  LIN break detection clear flag */
#define USART_ICR_CTSCF           (1 << 9)  /* Bit 9:  CTS interrupt clear flag */
#define USART_ICR_RTOCF           (1 << 11) /* Bit 11: Receiver timeout clear flag */
#define USART_ICR_EOBCF           (1 << 12) /* Bit 12: End of block clear flag */
#define USART_ICR_UDRCF           (1 << 13) /* Bit 13:SPI slave underrun clear flag */
#define USART_ICR_CMCF            (1 << 17) /* Bit 17: Character match clear flag */
#define USART_ICR_WUCF            (1 << 20) /* Bit 20: Wakeup from low-power mode clear flag */

#define USART_ICR_ALLBITS         (0x00123b7f)

/* Receive data register */

#define USART_RDR_SHIFT           (0)       /* Bits 0-8: Receive data value */
#define USART_RDR_MASK            (0x1ff << USART_RDR_SHIFT)

/* Transmit data register */

#define USART_TDR_SHIFT           (0)       /* Bits 0-8: Transmit data value */
#define USART_TDR_MASK            (0x1ff << USART_TDR_SHIFT)

/* Prescaler register */

#define USART_PRESC_SHIFT         (0)       /* Bits 0-3: Clock prescaler */
#define USART_PRESC_MASK          (15 << USART_PRESC_SHIFT)
#  define USART_PRESC_NODIV       (0 << USART_PRESC_SHIFT)  /* Input clock not divided */
#  define USART_PRESC_DIV1        (1 << USART_PRESC_SHIFT)  /* Input clock divided by 2 */
#  define USART_PRESC_DIV4        (2 << USART_PRESC_SHIFT)  /* Input clock divided by 4 */
#  define USART_PRESC_DIV6        (3 << USART_PRESC_SHIFT)  /* Input clock divided by 6 */
#  define USART_PRESC_DIV8        (4 << USART_PRESC_SHIFT)  /* Input clock divided by 8 */
#  define USART_PRESC_DIV10       (5 << USART_PRESC_SHIFT)  /* Input clock divided by 10 */
#  define USART_PRESC_DIV12       (6 << USART_PRESC_SHIFT)  /* Input clock divided by 12 */
#  define USART_PRESC_DIV16       (7 << USART_PRESC_SHIFT)  /* Input clock divided by 16 */
#  define USART_PRESC_DIV32       (8 << USART_PRESC_SHIFT)  /* Input clock divided by 32 */
#  define USART_PRESC_DIV64       (9 << USART_PRESC_SHIFT)  /* Input clock divided by 64 */
#  define USART_PRESC_DIV128      (10 << USART_PRESC_SHIFT) /* Input clock divided by 128 */
#  define USART_PRESC_DIV256      (11 << USART_PRESC_SHIFT) /* Input clock divided by 256 */
#endif /* CONFIG_STM32_STM32H7X3XX || CONFIG_STM32_STM32H7X7XX || CONFIG_STM32_STM32H7B3XX */
#endif /* __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32H7X3XX_UART_H */
